luentoEsimerkit2015/cliSerialVersion/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.2.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}

    castellatedMesh true;
    snap true;
    addLayers true;
    geometry
    {
        inletBig.stl
        {
            type triSurfaceMesh;
            name inletBig;
        }

        inletSmall.stl
        {
            type triSurfaceMesh;
            name inletSmall;
        }

        outlet.stl
        {
            type triSurfaceMesh;
            name outlet;
        }

        wall.stl
        {
            type triSurfaceMesh;
            name wall;
        }

        cylinder
        {
            type searchableCylinder;
            point1 ( -0.026 0.1 0.0 );
            point2 ( 0.05 0.1 0.0 );
            radius 0.025;
        }

    }

    castellatedMeshControls
    {
        features
        (
        );
        refinementSurfaces
        {
            inletBig
            {
                level ( 0 0 );
            }

            inletSmall
            {
                level ( 0 0 );
            }

            outlet
            {
                level ( 0 0 );
            }

            wall
            {
                level ( 1 2 );
            }

        }

        refinementRegions
        {
            cylinder
            {
                mode inside;
                levels (( 1E5 1 ));
            }

        }

        locationInMesh ( 0 0 0);
        maxLocalCells 100000;
        maxGlobalCells 2000000;
        minRefinementCells 0;
        nCellsBetweenLevels 2;
        resolveFeatureAngle 30.0;
        allowFreeStandingZoneFaces true;
        planarAngle 30;
        maxLoadUnbalance 0.1;
    }

    snapControls
    {
        nSolveIter 30;
        nSmoothPatch 3;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap true;
        explicitFeatureSnap false;
        multiRegionFeatureSnap false;
    }

    addLayersControls
    {
        layers
        {
            wall
            {
                nSurfaceLayers 5;
                expansionRatio 1.25;
                finalLayerThickness 0.4;
            }

        }

        relativeSizes true;
        expansionRatio 1.0;
        finalLayerThickness 0.3;
        minThickness 0.25;
        nGrow 0;
        featureAngle 130;
        slipFeatureAngle 30;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedianAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
    }

    meshQualityControls
    {
        maxNonOrtho 65;
        maxBoundarySkewness 20;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1.0E-13;
        minTetQuality 1.0E-15;
        minArea -1.0;
        minTwist 0.02;
        minDeterminant 0.001;
        minFaceWeight 0.05;
        minVolRatio 0.01;
        minTriangleTwist -1.0;
        nSmoothScale 4;
        errorReduction 0.75;
    }

    debug 0;
    mergeTolerance 1.0E-6;
    autoBlockMesh false;